#### FieldValues Constructor (IList(ValueAtPoint))

---

|  |
| --- |
| FieldValues Class   See Also |

Creates object from an array of domain point values

**Namespace:**   Autodesk.Revit.DB.Analysis
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public FieldValues( 	IList<ValueAtPoint> valueAtPoint ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub New ( _ 	valueAtPoint As IList(Of ValueAtPoint) _ ) ``` |

| Visual C++ |
| --- |
| ``` public: FieldValues( 	IList<ValueAtPoint^>^ valueAtPoint ) ``` |

#### Parameters

valueAtPoint
:   Type:  System.Collections.Generic IList   ValueAtPoint
     Array of values, each corresponding to a domain point

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | valueAtPoint array contains members with different numbers of measurements |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

FieldValues Class

FieldValues Overload

Autodesk.Revit.DB.Analysis Namespace